{"links": {"self": {"href": "data/repositories/levitsky/pyteomics/pullrequests/24/comments/74726016.json"}, "html": {"href": "#!/levitsky/pyteomics/pull-requests/24/_/diff#comment-74726016"}}, "deleted": false, "pullrequest": {"type": "pullrequest", "id": 24, "links": {"self": {"href": "data/repositories/levitsky/pyteomics/pullrequests/24.json"}, "html": {"href": "#!/levitsky/pyteomics/pull-requests/24"}}, "title": "Implement a simple PEFF parser"}, "content": {"raw": "We could add a separate header read function, though it’s more complex than the MGF header. Technically, reading a PEFF file should require first parsing the header, then making some decisions differently depending upon what is in the header. This controls things like what certain tags mean, where to look up the identities of custom modifications, and whether the proteins are proteoforms or designate every combination of features possible. The PEFF format also isn’t _done_ yet, so it’s hard to say what we’d need to do with that data.\n\nAs for factoring it into its own module, we can do that, but it will import some things which you might consider internal to the `fasta` module, like the `Protein` class. On the other hand, eventually supporting all those other features PEFF has might require it use its own version of those things.", "markup": "markdown", "html": "<p>We could add a separate header read function, though it’s more complex than the MGF header. Technically, reading a PEFF file should require first parsing the header, then making some decisions differently depending upon what is in the header. This controls things like what certain tags mean, where to look up the identities of custom modifications, and whether the proteins are proteoforms or designate every combination of features possible. The PEFF format also isn’t <em>done</em> yet, so it’s hard to say what we’d need to do with that data.</p>\n<p>As for factoring it into its own module, we can do that, but it will import some things which you might consider internal to the <code>fasta</code> module, like the <code>Protein</code> class. On the other hand, eventually supporting all those other features PEFF has might require it use its own version of those things.</p>", "type": "rendered"}, "created_on": "2018-09-01T23:10:18.520237+00:00", "user": {"display_name": "Joshua Klein", "uuid": "{919f0add-304d-4b9a-8889-d2622a3dbc96}", "links": {"self": {"href": "https://api.bitbucket.org/2.0/users/%7B919f0add-304d-4b9a-8889-d2622a3dbc96%7D"}, "html": {"href": "https://bitbucket.org/%7B919f0add-304d-4b9a-8889-d2622a3dbc96%7D/"}, "avatar": {"href": "data/secure.gravatar.com/avatar/7d0e70bc74f783efa621a2bdd228ca22d=httpsavatar-management--avatars.us-west-2.prod.public.atl-paas.netinitialsJK-3.png"}}, "nickname": "mobiusklein", "type": "user", "account_id": "557058:ff82222f-afe5-4135-a1b7-8de99a00f669"}, "updated_on": "2018-09-01T23:10:18.610765+00:00", "type": "pullrequest_comment", "id": 74726016}